package Multithreading;

public class Concurrency_concurrent {
    //Explain
    //**************************************************
    //офф объяснение Concurrency
    //Concurrency - выполнение сразу нескольких задач, в зависимости
    //от процессора компьютера concurrency-достигается разными способами
    //Parralleism - выполнение 2-ух и более задач параллельно.В многоядерных процессорах
    //достигается за счёт Paralleism'a.
    //-------------------------------------------------
    //Concurrency - согласованный.Пример: петь и кушать
    //как одноядерный процессор, видимость одновременной работы
    //достигается за счёт прерываний Context Switching(переключения задач)
    //**************************************************


    //Concurrent - параллельный.Пример: готовить и говорить по телефону
    //достигается за счёт параллеизма



}
