package Multithreading;

public class Sync_async {
    //в синхронном программировании задачи выполняются друг за другом
    //!!!в асинхронном каждая следующая не ждёт окончания выполнения предыдущей, помогает достичь concurrency


    //пример с двумя письмами Sync - последовательно
    //пишешь первое письмо
    //пишешь второе письмо

    //Async -  письма
    //параллельно - (в случае с одним ядром)может достигаться последовательностью, с прерываниями
    //двумя руками пишешь два письма сразу

    //сделать бутер и постирать бельё -асинхронно
}
